<pad>	0
<s>	0
</s>	0
<unk>	0
<IDENTITY>	0
in	-0
int	-1
64	-2
ar	-3
ch	-4
char	-5
ns	-6
ons	-7
cons	-8
const	-9
et	-10
si	-11
siz	-12
sizet	-13
ed	-14
constchar	-15
gn	-16
gned	-17
gnedint	-18
uns	-19
unsi	-20
unsignedint	-21
st	-22
ol	-23
re	-24
id	-25
at	-26
OR	-27
ORD	-28
WORD	-29
vo	-30
void	-31
ti	-32
QWORD	-33
bo	-34
bool	-35
le	-36
LE	-37
FI	-38
FILE	-39
op	-40
arg	-41
ing	-42
nt	-43
opti	-44
argp	-45
str	-46
stat	-47
ot	-48
qu	-49
quot	-50
quoting	-51
ct	-52
ent	-53
od	-54
on	-55
er	-56
stru	-57
struct	-58
mt	-59
ta	-60
as	-61
constargp	-62
uint	-63
xt	-64
ash	-65
al	-66
ble	-67
options	-68
ry	-69
entry	-70
hol	-71
option	-72
ode	-73
ou	-74
Id	-75
Idx	-76
ist	-77
val	-78
sty	-79
style	-80
quotingstyle	-81
quotingoptions	-82
set	-83
edf	-84
redf	-85
rea	-86
valist	-87
state	-88
strea	-89
fmt	-90
argpfmt	-91
argpfmtstrea	-92
tag	-93
or	-94
TE	-95
valisttag	-96
BY	-97
axt	-98
BYTE	-99
Hash	-100
32	-101
reg	-102
DWORD	-103
constargpoption	-104
structstat	-105
di	-106
redfat	-107
648	-108
maxt	-109
dou	-110
double	-111
argpfmtstreamt	-112
pe	-113
err	-114
tim	-115
table	-116
node	-117
odet	-118
uintmaxt	-119
Hashtable	-120
ext	-121
constvoid	-122
hash	-123
renode	-124
renodeset	-125
cti	-126
statet	-127
ff	-128
hashentry	-129
constcharconst	-130
holentry	-131
mat	-132
match	-133
dire	-134
co	-135
bint	-136
bintre	-137
cl	-138
ck	-139
bintreet	-140
ve	-141
ok	-142
cont	-143
Node	-144
ust	-145
12	-146
lo	-147
context	-148
ctive	-149
chardire	-150
chardirective	-151
mb	-152
string	-153
stringt	-154
restringt	-155
ret	-156
okent	-157
retokent	-158
gr	-159
oup	-160
group	-161
contextt	-162
)(	-163
ype	-164
it	-165
fa	-166
error	-167
clust	-168
cluster	-169
holcluster	-170
rematch	-171
rematchcontextt	-172
constargpstate	-173
chart	-174
timet	-175
flo	-176
float	-177
modet	-178
OL	-179
time	-180
codet	-181
tm	-182
pl	-183
regerr	-184
regerrcodet	-185
ad	-186
cp	-187
cpoptions	-188
constredfat	-189
il	-190
rpl	-191
rploption	-192
sy	-193
dr	-194
idt	-195
16	-196
constcpoptions	-197
fft	-198
wchart	-199
tol	-200
strtol	-201
strtolerror	-202
addr	-203
mbstatet	-204
par	-205
structtime	-206
647	-207
constrploption	-208
spe	-209
()(	-210
spec	-211
BO	-212
BOOL	-213
TS	-214
inf	-215
FTS	-216
constunsignedint	-217
redfa	-218
redfastatet	-219
tr	-220
opt	-221
signedint	-222
con	-223
ack	-224
ild	-225
intt	-226
wintt	-227
conv	-228
info	-229
am	-230
ctor	-231
bit	-232
bitset	-233
argpfmtstream	-234
constrenodeset	-235
bu	-236
un	-237
ffer	-238
offt	-239
constholentry	-240
Type	-241
6412	-242
an	-243
lon	-244
long	-245
::	-246
regext	-247
addrinfo	-248
structaddrinfo	-249
ile	-250
get	-251
128	-252
dfa	-253
child	-254
constargpchild	-255
Ve	-256
Vector	-257
de	-258
ock	-259
ord	-260
ser	-261
word	-262
constholcluster	-263
tun	-264
tuning	-265
constHash	-266
constHashtuning	-267
ptr	-268
sock	-269
wordt	-270
bitsetwordt	-271
longdouble	-272
sett	-273
getopt	-274
ssizet	-275
structtimespec	-276
synt	-277
regsynt	-278
conststat	-279
regsyntaxt	-280
lin	-281
cal	-282
type	-283
pentry	-284
pentrystate	-285
consttm	-286
64()(	-287
call	-288
parser	-289
fd	-290
DI	-291
DIR	-292
ern	-293
structtm	-294
em	-295
stack	-296
643	-297
gidt	-298
list	-299
and	-300
argpstate	-301
sig	-302
constHashtable	-303
ert	-304
convert	-305
convertstate	-306
structtimeval	-307
matcht	-308
wd	-309
md	-310
ame	-311
fast	-312
EN	-313
ENT	-314
FTSENT	-315
name	-316
su	-317
rechar	-318
fastcall	-319
recharsett	-320
Bu	-321
Buffer	-322
um	-323
ass	-324
Op	-325
ata	-326
data	-327
ction	-328
difft	-329
642	-330
argtype	-331
sub	-332
rand	-333
cc	-334
action	-335
lex	-336
upar	-337
amname	-338
constupar	-339
constuparamname	-340
fdset	-341
ptrdifft	-342
10	-343
en	-344
buffer	-345
item	-346
ST	-347
tOp	-348
dirent	-349
line	-350
pidt	-351
resub	-352
cmd	-353
pass	-354
passwd	-355
charconst	-356
lent	-357
uidt	-358
sockaddr	-359
socklent	-360
getoptdata	-361
pr	-362
ex	-363
dev	-364
constrestringt	-365
CT	-366
ap	-367
argum	-368
argument	-369
ft	-370
mbol	-371
symbol	-372
ge	-373
644	-374
ptrt	-375
tOpti	-376
Ir	-377
Iring	-378
ator	-379
6434	-380
File	-381
errort	-382
alr	-383
must	-384
ernalr	-385
randint	-386
getoptint	-387
optionlist	-388
getoptinternalr	-389
MN	-390
COL	-391
UMN	-392
fail	-393
COLUMN	-394
refail	-395
conststruct	-396
refailstack	-397
read	-398
devt	-399
ved	-400
es	-401
AL	-402
UE	-403
VAL	-404
gcc	-405
oken	-406
VALUE	-407
gccvalist	-408
refailstackt	-409
intmaxt	-410
matchtopt	-411
resubmatchtopt	-412
FF	-413
convt	-414
iconvt	-415
646	-416
mode	-417
mi	-418
constline	-419
structdirent	-420
att	-421
patt	-422
pattern	-423
ount	-424
tOption	-425
regmatcht	-426
ange	-427
sed	-428
mbchart	-429
repattern	-430
la	-431
ru	-432
645	-433
ermi	-434
file	-435
tab	-436
che	-437
vol	-438
rule	-439
atile	-440
change	-441
volatile	-442
modechange	-443
ob	-444
obstack	-445
constint	-446
BU	-447
ER	-448
tri	-449
BUFF	-450
BUFFER	-451
sym	-452
repatternbuffer	-453
blo	-454
diff	-455
block	-456
br	-457
ele	-458
Token	-459
acket	-460
elemt	-461
bracket	-462
sigaction	-463
bracketelemt	-464
sp	-465
ue	-466
mount	-467
mountentry	-468
rc	-469
sou	-470
sourc	-471
Filespec	-472
sa	-473
sigsett	-474
consttable	-475
os	-476
termi	-477
source	-478
termios	-479
spc	-480
27	-481
YY	-482
regofft	-483
fs	-484
rebitset	-485
rebitsetptrt	-486
structtermios	-487
RU	-488
TM	-489
CTU	-490
STRU	-491
CTUTM	-492
STRUCTUTM	-493
rol	-494
control	-495
constretokent	-496
sedcmd	-497
chardirectives	-498
build	-499
buildcmd	-500
structsigaction	-501
yp	-502
dir	-503
back	-504
ypet	-505
com	-506
compar	-507
ca	-508
el	-509
ir	-510
kt	-511
Acti	-512
vedir	-513
Activedir	-514
constregext	-515
Val	-516
ers	-517
vit	-518
Value	-519
rereg	-520
argvit	-521
isters	-522
reregisters	-523
consttOption	-524
te	-525
us	-526
ess	-527
status	-528
mp	-529
inta	-530
tions	-531
arr	-532
buf	-533
fts	-534
ftsent	-535
59	-536
FA	-537
ho	-538
constuint	-539
tmap	-540
infot	-541
tmapinfot	-542
CTL	-543
retokentypet	-544
constmbstatet	-545
CO	-546
641	-547
LCO	-548
act	-549
LCOent	-550
acttab	-551
timespec	-552
constmbchart	-553
Sr	-554
fca	-555
Srct	-556
odest	-557
refca	-558
reback	-559
cheentry	-560
Srctodest	-561
rebackrefca	-562
ccess	-563
erator	-564
argviterator	-565
ude	-566
structobstack	-567
yt	-568
ora	-569
stora	-570
ctx	-571
excl	-572
attri	-573
attribu	-574
structpasswd	-575
uc	-576
structstatfs	-577
yy	-578
able	-579
exclude	-580
restatet	-581
ableentry	-582
po	-583
posi	-584
tionset	-585
positionset	-586
BE	-587
ac	-588
hasher	-589
Hashcompar	-590
Hashhasher	-591
Hashcomparator	-592
20	-593
wn	-594
ATE	-595
Cho	-596
sys	-597
Chown	-598
STATE	-599
calls	-600
longt	-601
vector	-602
resizet	-603
YYBUFFER	-604
syscalls	-605
constChown	-606
YYBUFFERSTATE	-607
syscallslongt	-608
constChownoption	-609
fileinfo	-610
structsockaddr	-611
sx	-612
64(	-613
unk	-614
randread	-615
constoption	-616
randreadsource	-617
decl	-618
declspec	-619
readdeclspec	-620
buildcmdcontrol	-621
18	-622
Su	-623
tSu	-624
tSuccess	-625
ip	-626
cwd	-627
saved	-628
savedcwd	-629
num	-630
statenum	-631
attribute	-632
constfileinfo	-633
pi	-634
prt	-635
pipe	-636
stt	-637
lastt	-638
dirlist	-639
matchlastt	-640
resubmatchlastt	-641
ase	-642
diffblock	-643
consthashentry	-644
33	-645
85	-646
nfd	-647
inot	-648
nfdst	-649
El	-650
Sy	-651
se	-652
Elf	-653
Sym	-654
mas	-655
6419	-656
expr	-657
resi	-658
resift	-659
uintptrt	-660
resiftcontextt	-661
((	-662
(0	-663
))	-664
)))	-665
dim	-666
org	-667
ple	-668
Ftri	-669
lconv	-670
arrdim	-671
Ftriple	-672
orgarrdim	-673
structlconv	-674
cy	-675
cle	-676
6410	-677
Ring	-678
check	-679
cycle	-680
maskt	-681
checkstate	-682
cyclecheckstate	-683
MS	-684
ic	-685
drt	-686
mph	-687
code	-688
CTLMS	-689
class	-690
icmph	-691
icmphdrt	-692
IN	-693
serv	-694
randintsource	-695
25	-696
TA	-697
wh	-698
elp	-699
help	-700
valt	-701
etype	-702
rehash	-703
holhelp	-704
constFTS	-705
charclass	-706
rehashvalt	-707
holhelpstate	-708
ut	-709
acl	-710
ler	-711
base	-712
nlin	-713
chunk	-714
andler	-715
decode	-716
nlinkt	-717
obstackchunk	-718
decodecontext	-719
constmountentry	-720
Lo	-721
sd	-722
410	-723
STY	-724
adM	-725
fla	-726
atsd	-727
onet	-728
LoadM	-729
YYSTY	-730
inaddr	-731
whatsd	-732
LoadMode	-733
tOptions	-734
statemaskt	-735
whatsdonet	-736
tOptionLoadMode	-737
IO	-738
gm	-739
rm	-740
ove	-741
attr	-742
ovec	-743
segm	-744
sigh	-745
IOFILE	-746
estora	-747
andlert	-748
ctiovec	-749
dirattr	-750
segment	-751
estoraget	-752
rmoptions	-753
sighandlert	-754
structiovec	-755
excludesegment	-756
bintreestoraget	-757
constrecharsett	-758
30	-759
40	-760
92	-761
bl	-762
lfd	-763
pol	-764
aclt	-765
mpbuf	-766
pollfd	-767
mpbuftag	-768
argtypest	-769
99	-770
net	-771
deft	-772
gnuc	-773
netdeft	-774
gnucvalist	-775
constSTRUCTUTM	-776
CB	-777
ED	-778
RM	-779
ayt	-780
arrayt	-781
RMstatus	-782
statearrayt	-783
parsercontrol	-784
86	-785
CC	-786
servtab	-787
constdfa	-788
61	-789
76	-790
89	-791
CF	-792
FC	-793
cd	-794
BFA	-795
Map	-796
blk	-797
cdi	-798
fil	-799
mem	-800
2789	-801
tOpt	-802
user	-803
cdbuf	-804
memcdi	-805
userid	-806
blksizet	-807
memcdiconv	-808
buildcmdstate	-809
ES	-810
NS	-811
oc	-812
NSE	-813
RES	-814
res	-815
ONSE	-816
fsres	-817
types	-818
CTLRES	-819
storage	-820
sockaddrstorage	-821
constredfastatet	-822
75	-823
80	-824
px	-825
bel	-826
byt	-827
utm	-828
bytes	-829
label	-830
utmpx	-831
CBUFFER	-832
sedlabel	-833
pipebytes	-834
24	-835
71	-836
77	-837
DA	-838
277	-839
730	-840
FAE	-841
ino	-842
1024	-843
1877	-844
2092	-845
exit	-846
print	-847
regex	-848
devino	-849
7302092	-850
printint	-851
6)	-852
AE	-853
gt	-854
tc	-855
apt	-856
ink	-857
flagt	-858
token	-859
tcflagt	-860
readline	-861
structutmpx	-862
optstatemaskt	-863
constmodechange	-864
46	-865
FD	-866
fi	-867
he	-868
li	-869
64)	-870
rli	-871
2)))	-872
acem	-873
ader	-874
repl	-875
header	-876
acement	-877
timeval	-878
replacement	-879
replacementtypes	-880
no	-881
Des	-882
dic	-883
Desc	-884
indic	-885
subst	-886
atorno	-887
tOptDesc	-888
sockaddrin	-889
indicatorno	-890
nd	-891
100	-892
aut	-893
env	-894
eue	-895
fnt	-896
isa	-897
ort	-898
tem	-899
1000	-900
appe	-901
auth	-902
ndqu	-903
proc	-904
sort	-905
isaac	-906
yytype	-907
ndqueue	-908
authdata	-909
sortfile	-910
comparfnt	-911
yytypeint	-912
isaacstate	-913
appendqueue	-914
constrmoptions	-915
11	-916
17	-917
nl	-918
loc	-919
1017	-920
4104	-921
yyal	-922
lines	-923
nlitem	-924
LBUFFER	-925
yyalloc	-926
pipelines	-927
constFTSENT	-928
consttimeval	-929
88	-930
RS	-931
BLE	-932
CCU	-933
OCCU	-934
text	-935
TABLE	-936
OCCURS	-937
filename	-938
WORDTABLE	-939
39	-940
TU	-941
cs	-942
ITS	-943
TUS	-944
col	-945
cop	-946
mit	-947
oto	-948
xat	-949
copy	-950
ping	-951
valu	-952
ITSTA	-953
proto	-954
rlimit	-955
stream	-956
copyreg	-957
ITSTATUS	-958
csstatus	-959
protoent	-960
valuetype	-961
FILEstream	-962
constlinebuffer	-963
28	-964
47	-965
63	-966
AD	-967
DC	-968
Di	-969
516	-970
920	-971
FAB	-972
one	-973
ucs	-974
4733	-975
funk	-976
zone	-977
funky	-978
getfunky	-979
pingstat	-980
consttimet	-981
getfunkystring	-982
35	-983
BB	-984
Co	-985
En	-986
mm	-987
Env	-988
Comm	-989
eval	-990
host	-991
reset	-992
teEnv	-993
Command	-994
Options	-995
hostent	-996
timezone	-997
resetType	-998
constsizet	-999
constftsent	-1000
constOptions	-1001
structrlimit	-1002
timezoneptrt	-1003
consttOptDesc	-1004
In	-1005
up	-1006
Con	-1007
dIn	-1008
end	-1009
ssi	-1010
fsty	-1011
send	-1012
dIncl	-1013
permi	-1014
ssion	-1015
backup	-1016
fstype	-1017
CondIncl	-1018
filetype	-1019
sendlist	-1020
backuptype	-1021
fstypelist	-1022
permission	-1023
constdirlist	-1024
constbintreet	-1025
constpositionset	-1026
AA	-1027
AC	-1028
DE	-1029
WA	-1030
ey	-1031
fn	-1032
ma	-1033
063	-1034
332	-1035
559	-1036
CAC	-1037
eld	-1038
key	-1039
5598	-1040
DEAE	-1041
main	-1042
25410	-1043
field	-1044
plink	-1045
332063	-1046
exitfn	-1047
inaddrt	-1048
argmatch	-1049
difftype	-1050
keyfield	-1051
yystatet	-1052
constexpr	-1053
WAITSTATUS	-1054
yystatetype	-1055
argmatchexitfn	-1056
05	-1057
13	-1058
43	-1059
70	-1060
bt	-1061
108	-1062
182	-1063
199	-1064
688	-1065
751	-1066
AFF	-1067
BEA	-1068
glo	-1069
lst	-1070
ore	-1071
3546	-1072
4033	-1073
6411	-1074
Dict	-1075
EDFD	-1076
cale	-1077
19905	-1078
33182	-1079
86751	-1080
count	-1081
filed	-1082
globt	-1083
orext	-1084
countT	-1085
envlst	-1086
locale	-1087
8019905	-1088
colorext	-1089
354633182	-1090
colorexttype	-1091
41	-1092
97	-1093
rr	-1094
183	-1095
200	-1096
Set	-1097
Tok	-1098
ens	-1099
enu	-1100
ere	-1101
wct	-1102
0)))	-1103
4097	-1104
8200	-1105
mapt	-1106
clock	-1107
enumt	-1108
ererr	-1109
Tokens	-1110
temapt	-1111
ccessor	-1112
wctypet	-1113
clockidt	-1114
successor	-1115
xatattribu	-1116
argvitererr	-1117
readlinestate	-1118
valuetypemapt	-1119
xatattributemapt	-1120
42	-1121
fp	-1122
fre	-1123
essor	-1124
freer	-1125
fstatus	-1126
textbuf	-1127
Hashdata	-1128
Hashproc	-1129
constbool	-1130
exitcodet	-1131
constdirent	-1132
constsigsett	-1133
Hashdatafreer	-1134
Hashprocessor	-1135
56	-1136
CH	-1137
ao	-1138
wt	-1139
162	-1140
228	-1141
271	-1142
446	-1143
649	-1144
FDD	-1145
RCH	-1146
cct	-1147
let	-1148
6414	-1149
fpuc	-1150
sink	-1151
amest	-1152
aofla	-1153
fpucwt	-1154
tablet	-1155
aoflagn	-1156
RCHstatus	-1157
aoflagnamest	-1158
constkeyfield	-1159
procstatemaskt	-1160
constfstypelist	-1161
79	-1162
136	-1163
163	-1164
fig	-1165
ial	-1166
ity	-1167
off	-1168
Case	-1169
entt	-1170
sage	-1171
temp	-1172
trac	-1173
16385	-1174
config	-1175
xtimet	-1176
servent	-1177
tempnode	-1178
constwchart	-1179
conststructtm	-1180
constSrctodest	-1181
refailstackentt	-1182
constbitsetwordt	-1183
tempnodevolatile	-1184
Ar	-1185
To	-1186
gL	-1187
sl	-1188
ze	-1189
gno	-1190
out	-1191
tAr	-1192
teT	-1193
uts	-1194
6432	-1195
igno	-1196
save	-1197
slcl	-1198
10000	-1199
extTo	-1200
gList	-1201
uintt	-1202
savewd	-1203
stackt	-1204
tracet	-1205
envlist	-1206
slclist	-1207
utsname	-1208
tArgList	-1209
teTextTo	-1210
uintfast	-1211
structgroup	-1212
localestruct	-1213
consttimespec	-1214
ignorepattern	-1215
00	-1216
58	-1217
BF	-1218
cu	-1219
gg	-1220
to	-1221
000	-1222
192	-1223
210	-1224
283	-1225
2::	-1226
cur	-1227
fsu	-1228
har	-1229
5886	-1230
6283	-1231
ggle	-1232
files	-1233
secur	-1234
588625	-1235
toggle	-1236
unshar	-1237
dfamust	-1238
fsusage	-1239
special	-1240
modelist	-1241
security	-1242
togglelist	-1243
specialfiles	-1244
structutsname	-1245
unsharexitcodet	-1246
securitycontextt	-1247
04	-1248
48	-1249
FB	-1250
ag	-1251
4::	-1252
879	-1253
ato	-1254
edt	-1255
map	-1256
mnt	-1257
put	-1258
roc	-1259
()()	-1260
1)))	-1261
1025	-1262
8504	-1263
mict	-1264
spwd	-1265
13686	-1266
listt	-1267
agchar	-1268
mntent	-1269
output	-1270
sigato	-1271
speedt	-1272
mapmaskt	-1273
optionxat	-1274
constcdbuf	-1275
constchara	-1276
sigatomict	-1277
tokenlistt	-1278
constobstack	-1279
intattribute	-1280
structinaddr	-1281
charclassword	-1282
constsavedcwd	-1283
agcharmapmaskt	-1284
attributeenumt	-1285
valuetypeenumt	-1286
can	-1287
ize	-1288
oni	-1289
umn	-1290
8192	-1291
open	-1292
rlimt	-1293
calize	-1294
canoni	-1295
column	-1296
openfile	-1297
columninfo	-1298
constIring	-1299
localeinfo	-1300
calizemodet	-1301
constcolumninfo	-1302
constlocaleinfo	-1303
3)	-1304
BC	-1305
Ch	-1306
alt	-1307
ank	-1308
ary	-1309
bin	-1310
fam	-1311
tDi	-1312
BCIN	-1313
Tern	-1314
ilyt	-1315
uude	-1316
blank	-1317
calet	-1318
ctype	-1319
safam	-1320
tDire	-1321
Change	-1322
binstr	-1323
sigalt	-1324
Ternary	-1325
localet	-1326
textint	-1327
uudecode	-1328
blanktype	-1329
safamilyt	-1330
texttypes	-1331
linebuffer	-1332
tDirection	-1333
constbinstr	-1334
sigaltstack	-1335
BCINITSTATUS	-1336
t	-1337
n	-1338
i	-1339
s	-1340
c	-1341
r	-1342
a	-1343
e	-1344
o	-1345
4	-1346
h	-1347
6	-1348
d	-1349
g	-1350
u	-1351
z	-1352
l	-1353
p	-1354
b	-1355
v	-1356
m	-1357
D	-1358
O	-1359
R	-1360
f	-1361
W	-1362
I	-1363
E	-1364
8	-1365
F	-1366
Q	-1367
L	-1368
0	-1369
y	-1370
x	-1371
q	-1372
2	-1373
T	-1374
B	-1375
3	-1376
1	-1377
k	-1378
Y	-1379
w	-1380
H	-1381
(	-1382
)	-1383
N	-1384
S	-1385
7	-1386
C	-1387
:	-1388
A	-1389
U	-1390
V	-1391
5	-1392
9	-1393
M	-1394
