sub_6F0
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.getenv
getenv
.fprintf
fprintf
.gettext
gettext
.malloc
malloc
__cxa_finalize
__cxa_finalize
register_tm_clones
.fileno
fileno
.strtoul
strtoul
deregister_tm_clones
_bss_start
.setvbuf
setvbuf
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
_bss_start
_bss_start
frame_dummy
register_tm_clones
fileno_to_name
STRING
STRING
STRING
STRING
.term_proc
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
sub_1BE0
stdbuf
getenv
\"_STDBUF_E\"
getenv
\"_STDBUF_I\"
getenv
\"_STDBUF_O\"
apply_mode
stderr
apply_mode
stdin
apply_mode
stdout
.getenv
getenv
.abort
abort
apply_mode
setvbuf
setvbuf
strtoul
fileno
fileno_to_name
gettext
\"invalid buffering mode %s for %s\\n\"
fprintf
stderr
malloc
gettext
\"failed to allocate a %lu byte stdio buffer\\n\"
fprintf
stderr
setvbuf
fileno
fileno_to_name
gettext
\"could not set buffering of %s to mode %s\\n\"
fprintf
stderr
.free
free
frame_dummy
register_tm_clones
.iswlower
iswlower
.getc_unlocked
getc_unlocked
.__fpending
_fpending
.strncmp
strncmp
swallow_file_in_memory
strcmp
\"-\"
fstat
open
__errno_location
error
\"%s\"
fstat
__errno_location
error
\"%s\"
xmalloc
read
__errno_location
error
\"%s\"
xmalloc
read
xrealloc
__errno_location
error
\"%s\"
__errno_location
error
\"%s\"
close
.strcasecmp
strcasecmp
.__ctype_get_mb_cur_max
_ctype_get_mb_cur_max
.qsort
qsort
.wcscoll
wcscoll
output_one_roff_line
printf
\".%s \\\"\"
macro_name
print_field
tail
qword_2297D8
fputs_unlocked
STRING
stdout
tail_truncation
putchar_unlocked
fwrite_unlocked
STRING
stdout
fputs_unlocked
STRING
stdout
before_truncation
print_field
before
qword_2297F8
putchar_unlocked
fwrite_unlocked
STRING
stdout
print_field
keyafter
qword_229818
fputs_unlocked
STRING
stdout
keyafter_truncation
putchar_unlocked
fwrite_unlocked
STRING
stdout
fputs_unlocked
STRING
stdout
head_truncation
print_field
head
qword_229838
putchar_unlocked
fwrite_unlocked
STRING
stdout
print_field
STRING
qword_229858
putchar_unlocked
auto_reference
input_reference
putchar_unlocked
.__errno_location
_errno_location
.mbrtowc
mbrtowc
.bindtextdomain
bindtextdomain
.toupper
toupper
output_one_dumb_line
print_field
STRING
qword_229858
putchar_unlocked
print_spaces
reference_max_width
gap_size
qword_229858
STRING
print_field
STRING
qword_229858
print_spaces
reference_max_width
gap_size
qword_229858
STRING
auto_reference
right_reference
half_line_width
gap_size
qword_2297F8
before
truncation_string_length
before_truncation
print_field
tail
qword_2297D8
fputs_unlocked
STRING
stdout
tail_truncation
truncation_string_length
before_truncation
half_line_width
gap_size
qword_2297F8
before
qword_2297D8
tail
truncation_string_length
tail_truncation
tail
qword_2297D8
print_spaces
fputs_unlocked
STRING
stdout
before_truncation
print_field
before
qword_2297F8
print_spaces
gap_size
print_field
keyafter
qword_229818
fputs_unlocked
STRING
stdout
keyafter_truncation
truncation_string_length
keyafter_truncation
print_spaces
half_line_width
qword_229818
keyafter
auto_reference
input_reference
right_reference
truncation_string_length
keyafter_truncation
half_line_width
qword_229818
keyafter
qword_229838
head
truncation_string_length
head_truncation
print_spaces
fputs_unlocked
STRING
stdout
head_truncation
print_field
head
qword_229838
head
qword_229838
print_spaces
gap_size
print_field
STRING
qword_229858
right_reference
auto_reference
input_reference
putchar_unlocked
._exit
exit
.freopen
freopen
.getopt_long
getopt_long
.textdomain
textdomain
proper_name
gettext
mbsstr_trimmed_wordbounded
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
.strcpy
strcpy
.read
read
.printf
printf
.iswctype
iswctype
proper_name_utf8
gettext
locale_charset
xstr_iconv
STRING
strlen
xmalloc
memcpy
memcpy
STRING
xstr_iconv
STRING
free
free
strchr
c_strcasecmp
STRING
free
free
free
free
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
free
free
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
strcmp
.iconv
iconv
.strcmp
strcmp
.memset
memset
.__stack_chk_fail
_stack_chk_fail
.fclose
fclose
version_etc_arn
fprintf
\"%s (%s) %s\\n\"
fprintf
\"%s %s\\n\"
gettext
\"(C)\"
fprintf
\"Copyright %s %d Free Software Foundation, Inc.\"
gettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
gettext
\"Written by %s.\\n\"
fprintf
gettext
\"Written by %s and %s.\\n\"
fprintf
gettext
\"Written by %s, %s, and %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
fprintf
gettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, %s, and others.\\n\"
fprintf
.tolower
tolower
.strnlen
strnlen
.dup2
dup2
.strlen
strlen
.wctype
wctype
.ungetc
ungetc
.gettext
gettext
.strrchr
strrchr
.calloc
calloc
.strchr
strchr
.setlocale
setlocale
.fscanf
fscanf
.putchar_unlocked
putchar_unlocked
.__assert_fail
_assert_fail
.open
open
.malloc
malloc
.memchr
memchr
.close
close
.__fxstat
_fxstat
.exit
exit
.fputs_unlocked
fputs_unlocked
re_string_construct_common
.memcmp
memcmp
.realloc
realloc
.iswprint
iswprint
.fprintf
fprintf
re_string_translate_buffer
.ferror_unlocked
ferror_unlocked
.iconv_close
iconv_close
deregister_tm_clones
_bss_start
.fileno
fileno
re_string_fetch_byte_case
re_string_char_size_at
.memcpy
memcpy
.memmove
memmove
.iswalnum
iswalnum
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
re_node_set_init_1
malloc
.putc_unlocked
putc_unlocked
.towupper
towupper
.nl_langinfo
nl_langinfo
compare_occurs
compare_words
re_node_set_init_copy
malloc
memcpy
memset
.wcrtomb
wcrtomb
.sprintf
sprintf
.fdopen
fdopen
sort_found_occurs
qsort
occurs_table
number_of_occurs
compare_occurs
.fwrite_unlocked
fwrite_unlocked
.mbsinit
mbsinit
re_node_set_merge
realloc
memcpy
memcpy
memcpy
.iswspace
iswspace
digest_break_file
swallow_file_in_memory
memset
word_fastmap
word_fastmap
to_uchar
byte_229540
byte_229529
byte_22952A
gnu_extensions
free
.btowc
btowc
.iconv_open
iconv_open
rpl_re_compile_pattern
rpl_re_syntax_options
re_compile_internal
rpl_re_syntax_options
gettext
\"Success\"
_re_error_msgid_idx
.error
error
print_spaces
putchar_unlocked
.towlower
towlower
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
rpl_re_set_syntax
rpl_re_syntax_options
rpl_re_syntax_options
.strtoul
strtoul
.__cxa_atexit
_cxa_atexit
.fwrite
fwrite
.strdup
strdup
__cxa_finalize
__cxa_finalize
.__ctype_b_loc
_ctype_b_loc
register_tm_clones
to_uchar
matcher_error
gettext
\"error in regular expression matcher\"
__errno_location
error
exit
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
compile_regex
folded_chars
ignore_case
strlen
rpl_re_compile_pattern
quote
gettext
\"%s (for regexp %s)\"
error
rpl_re_compile_fastmap
rpl_re_compile_fastmap
memset
re_compile_fastmap_iter
re_compile_fastmap_iter
re_compile_fastmap_iter
re_compile_fastmap_iter
initialize_regex
folded_chars
toupper
ignore_case
context_regex
context_regex
context_regex
STRING
context_regex
STRING
gnu_extensions
input_reference
context_regex
compile_regex
context_regex
context_regex
compile_regex
word_regex
word_regex
break_file
gnu_extensions
__ctype_b_loc
word_fastmap
word_fastmap
memset
word_fastmap
byte_229540
byte_229529
byte_22952A
gnu_extensions
break_file
compare_words
folded_chars
to_uchar
folded_chars
to_uchar
to_uchar
to_uchar
ignore_case
print_field
diacrit_base
STRING
locale
printf
\"\\\\^%s%c\"
STRING
locale
printf
\"\\\\`%s%c\"
STRING
locale
printf
\"\\\\~%s%c\"
STRING
locale
printf
\"\\\\'%s%c\"
STRING
locale
printf
\"\\\\\\\"%s%c\"
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
printf
\"\\\\c{%c}\"
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
fwrite_unlocked
STRING
stdout
putchar_unlocked
putchar_unlocked
putchar_unlocked
putchar_unlocked
putchar_unlocked
printf
\"$\\\\%c$\"
diacrit_diac
output_format
putchar_unlocked
edited_flag
rpl_regfree
free_dfa_content
free
free
search_table
compare_words
copy_unescaped_string
strlen
xmalloc
__ctype_b_loc
to_uchar
find_occurs_in_text
text_buffer
text_buffer
__ctype_b_loc
to_uchar
qword_229688
__ctype_b_loc
to_uchar
qword_229688
input_reference
text_buffer
qword_229688
rpl_re_search
unk_229128
qword_229688
qword_229688
context_regs
matcher_error
qword_2294F0
context_regex
__ctype_b_loc
to_uchar
rpl_re_search
unk_229288
word_regs
matcher_error
qword_229508
qword_229510
word_fastmap
to_uchar
word_fastmap
to_uchar
word_regex
maximum_word_length
maximum_word_length
input_reference
total_line_count
__ctype_b_loc
to_uchar
qword_229688
xalloc_die
occurs_alloc
occurs_alloc
occurs_alloc
occurs_table
xrealloc
occurs_table
occurs_alloc
number_of_occurs
occurs_alloc
occurs_table
number_of_occurs
total_line_count
__ctype_b_loc
to_uchar
qword_229688
total_line_count
reference_max_width
reference_max_width
input_reference
auto_reference
__ctype_b_loc
to_uchar
__ctype_b_loc
to_uchar
input_reference
number_of_occurs
ignore_file
search_table
ignore_table
only_file
search_table
only_table
qword_229688
generate_all_output
tail
qword_2297D8
tail_truncation
head
qword_229838
head_truncation
occurs_table
number_of_occurs
number_of_occurs
define_all_fields
output_one_roff_line
output_one_dumb_line
output_one_tex_line
output_format
output_format
output_format
init_word_char
__ctype_b_loc
digest_word_file
swallow_file_in_memory
xalloc_die
xrealloc
qsort
compare_words
define_all_fields
keyafter
qword_229818
keyafter
keyafter
keyafter
qword_229818
qword_229818
rpl_re_match
unk_229288
matcher_error
word_fastmap
to_uchar
word_fastmap
to_uchar
word_regex
keyafter
keyafter_max_width
qword_229818
keyafter
keyafter_max_width
STRING
qword_229818
keyafter_truncation
__ctype_b_loc
to_uchar
qword_229818
qword_229818
qword_229818
keyafter
keyafter
keyafter
half_line_width
maximum_word_length
rpl_re_match
unk_229288
keyafter
matcher_error
keyafter
word_fastmap
to_uchar
word_fastmap
to_uchar
word_regex
half_line_width
maximum_word_length
before
qword_2297F8
keyafter
qword_2297F8
__ctype_b_loc
to_uchar
qword_2297F8
qword_2297F8
before
rpl_re_match
unk_229288
before
qword_2297F8
before
matcher_error
before
before
before
qword_2297F8
word_fastmap
to_uchar
before
before
word_fastmap
to_uchar
before
word_regex
before_max_width
before
qword_2297F8
before
__ctype_b_loc
to_uchar
text_buffer
before_truncation
before_truncation
STRING
__ctype_b_loc
to_uchar
before
before
before
qword_229688
before_max_width
qword_2297F8
before
gap_size
tail
qword_2297D8
tail_truncation
tail
qword_229818
tail
__ctype_b_loc
to_uchar
tail
tail
qword_229688
qword_2297D8
tail
tail
qword_2297D8
rpl_re_match
unk_229288
matcher_error
word_fastmap
to_uchar
word_fastmap
to_uchar
word_regex
tail
qword_2297D8
tail
tail_truncation
keyafter_truncation
STRING
qword_2297D8
tail_truncation
qword_2297D8
tail
__ctype_b_loc
to_uchar
qword_2297D8
qword_2297D8
qword_2297D8
tail
keyafter_max_width
qword_229818
keyafter
gap_size
head
qword_229838
head_truncation
qword_229838
before
qword_229838
__ctype_b_loc
to_uchar
qword_229838
qword_229838
text_buffer
head
rpl_re_match
unk_229288
head
qword_229838
head
matcher_error
head
head
head
qword_229838
word_fastmap
to_uchar
head
head
word_fastmap
to_uchar
head
word_regex
head
qword_229838
head_truncation
before_truncation
STRING
head
head_truncation
qword_229838
head
__ctype_b_loc
to_uchar
head
head
head
qword_229838
file_line_count
input_file_name
locale
file_line_count
sprintf
STRING
\"%s:%d\"
STRING
strlen
STRING
qword_229858
input_reference
STRING
keyafter
qword_229858
STRING
qword_229858
qword_229858
qword_229858
__ctype_b_loc
to_uchar
qword_229858
input_reference
auto_reference
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
free_workarea_compile
free
free
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
gettext
\"Usage: %s [OPTION]... [INPUT]...   (without -G)\\n  or:  %s -G [OPTION]... [INPUT [OUTPUT]]\\n\"
printf
stdout
gettext
\"Output a permuted index, including context, of the words in the input files.\\n\\n\"
fputs_unlocked
stdout
gettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
gettext
\"  -A, --auto-reference           output automatically generated references\\n  -G, --traditional              behave more like System V `ptx'\\n  -F, --flag-truncation=STRING   use STRING for flagging line truncations\\n\"
fputs_unlocked
stdout
gettext
\"  -M, --macro-name=STRING        macro name to use instead of `xx'\\n  -O, --format=roff              generate output as roff directives\\n  -R, --right-side-refs          put references at right, not counted in -w\\n  -S, --sentence-regexp=REGEXP   for end of lines or end of sentences\\n  -T, --format=tex               generate output as TeX directives\\n\"
fputs_unlocked
stdout
gettext
\"  -W, --word-regexp=REGEXP       use REGEXP to match each keyword\\n  -b, --break-file=FILE          word break characters in this FILE\\n  -f, --ignore-case              fold lower case to upper case for sorting\\n  -g, --gap-size=NUMBER          gap size in columns between output fields\\n  -i, --ignore-file=FILE         read ignore word list from FILE\\n  -o, --only-file=FILE           read only word list from this FILE\\n\"
fputs_unlocked
stdout
gettext
\"  -r, --references               first field of each line is a reference\\n  -t, --typeset-mode               - not implemented -\\n  -w, --width=NUMBER             output width in columns, reference excluded\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nWith no FILE or if FILE is -, read Standard Input.  `-F /' by default.\\n\"
fputs_unlocked
emit_ancillary_info
exit
fix_output_parameters
reference_max_width
file_line_count
file_line_count
sprintf
\"%d\"
strlen
strlen
input_file_name
input_file_name
reference_max_width
reference_max_width
number_input_files
STRING
xmalloc
reference_max_width
auto_reference
line_width
reference_max_width
gap_size
auto_reference
input_reference
right_reference
half_line_width
line_width
before_max_width
line_width
gap_size
keyafter_max_width
line_width
truncation_string_length
strlen
STRING
STRING
STRING
STRING
before_max_width
truncation_string_length
before_max_width
before_max_width
keyafter_max_width
truncation_string_length
keyafter_max_width
truncation_string_length
gnu_extensions
edited_flag
__ctype_b_loc
byte_2296CC
byte_2296E2
STRING
edited_flag
to_uchar
edited_flag
diacrit_diac
output_format
output_format
output_format
version_etc_ar
version_etc_arn
analyze
malloc
malloc
malloc
malloc
malloc
preorder
optimize_subexps
free
postorder
lower_subexps
postorder
calc_first
preorder
calc_next
preorder
link_nfa_nodes
calc_eclosure
malloc
calc_inveclosure
mbsstr_trimmed_wordbounded
trim2
mbsstr
__ctype_b_loc
strlen
__ctype_b_loc
memset
mbuiter_multi_next
abort
iswalnum
memset
memset
mbuiter_multi_next
mbuiter_multi_next
abort
mbuiter_multi_next
iswalnum
memset
mbuiter_multi_next
__ctype_get_mb_cur_max
free
is_basic
is_basic_table
output_one_tex_line
printf
\"\\\\%s \"
macro_name
putchar_unlocked
print_field
tail
qword_2297D8
fwrite_unlocked
off_23078
stdout
print_field
before
qword_2297F8
fwrite_unlocked
off_23078
stdout
keyafter
qword_229818
keyafter
rpl_re_match
unk_229288
keyafter
qword_229818
keyafter
matcher_error
qword_229818
word_fastmap
to_uchar
word_fastmap
to_uchar
keyafter
word_regex
print_field
fwrite_unlocked
off_23078
stdout
print_field
fwrite_unlocked
off_23078
stdout
print_field
head
qword_229838
putchar_unlocked
putchar_unlocked
print_field
STRING
qword_229858
putchar_unlocked
auto_reference
input_reference
putchar_unlocked
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
peek_token_bracket
version_etc_va
version_etc_arn
mbuiter_multi_next
is_basic
__assert_fail
\"mbsinit (&iter->state)\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strnlen1
mbrtowc
strlen
__assert_fail
\"*iter->cur.ptr == '\\\\0'\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
__assert_fail
\"iter->cur.wc == 0\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
main
set_program_name
setlocale
locale
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
getopt_long
\"AF:GM:ORS:TW:b:i:fg:o:trw:\"
long_options
input_file_name
xmalloc
file_line_count
xmalloc
number_input_files
input_file_name
number_input_files
optind
input_file_name
xmalloc
optind
file_line_count
xmalloc
number_input_files
input_file_name
optind
input_file_name
optind
strcmp
optind
\"-\"
optind
number_input_files
number_input_files
input_file_name
xmalloc
file_line_count
xmalloc
input_file_name
optind
input_file_name
optind
strcmp
optind
\"-\"
optind
__errno_location
error
\"%s\"
freopen_safer
optind
STRING
stdout
optind
optind
quote
optind
gettext
\"extra operand %s\"
error
usage
optind
gnu_extensions
optind
gnu_extensions
output_format
output_format
initialize_regex
digest_break_file
break_file
break_file
digest_word_file
ignore_file
ignore_table
ignore_file
qword_229640
ignore_file
digest_word_file
only_file
only_table
only_file
qword_229660
only_file
number_of_occurs
total_line_count
maximum_word_length
reference_max_width
swallow_file_in_memory
input_file_name
text_buffer
find_occurs_in_text
file_line_count
total_line_count
number_input_files
sort_found_occurs
fix_output_parameters
generate_all_output
exit
context_regex
copy_unescaped_string
optarg
quotearg
optarg
gettext
\"invalid gap width: %s\"
error
xstrtoul
optarg
gap_size
input_reference
quotearg
optarg
gettext
\"invalid line width: %s\"
error
xstrtoul
optarg
line_width
ignore_file
optarg
only_file
optarg
word_regex
copy_unescaped_string
optarg
word_regex
word_regex
break_file
optarg
ignore_case
output_format
STRING
copy_unescaped_string
optarg
macro_name
optarg
output_format
right_reference
gnu_extensions
output_format
format_vals
_xargmatch_internal
STRING
optarg
format_args
format_vals
argmatch_die
usage
auto_reference
proper_name_utf8
STRING
unk_23836
version_etc
stdout
STRING
STRING
STRING
exit
usage
xmem_cd_iconv
mem_cd_iconv
xalloc_die
__errno_location
xstr_cd_iconv
str_cd_iconv
xalloc_die
__errno_location
parse_dup_op
fetch_number
fetch_number
fetch_token
postorder
free_tree
duplicate_tree
create_tree
duplicate_tree
postorder
mark_opt_subexp
create_tree
duplicate_tree
create_tree
create_tree
create_tree
strnlen1
memchr
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
__argmatch_die
usage
argmatch
strlen
strlen
memcmp
strncmp
is_basic_0
is_basic_table
parse_bracket_symbol
re_string_fetch_byte_case
xstr_iconv
str_iconv
xalloc_die
__errno_location
base_len
strlen
argmatch_invalid
gettext
\"invalid argument %s for %s\"
gettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
close_stdout_set_file_name
file_name
argmatch_valid
gettext
\"Valid arguments are:\"
fprintf
stderr
fprintf
stderr
\", `%s'\"
fprintf
stderr
\"\\n  - `%s'\"
memcmp
putc_unlocked
stderr
fetch_number
fetch_token
mbiter_multi_next
is_basic_0
__assert_fail
\"mbsinit (&iter->state)\"
\"mbiter.h\"
\"mbiter_multi_next\"
mbsinit
mbrtowc
__assert_fail
\"*iter->cur.ptr == '\\\\0'\"
\"mbiter.h\"
\"mbiter_multi_next\"
__assert_fail
\"iter->cur.wc == 0\"
\"mbiter.h\"
\"mbiter_multi_next\"
mbsinit
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
protect_fd
open
\"/dev/null\"
close
__errno_location
argmatch_to_argument
memcmp
mark_opt_subexp
last_component
quote_n
quotearg_n_style
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
trim2
strdup
xalloc_die
__ctype_b_loc
strlen
memmove
strlen
__ctype_b_loc
strlen
memset
mbiter_multi_next
iswspace
strlen
memmove
strlen
memset
mbiter_multi_next
iswspace
iswspace
iswspace
iswspace
iswspace
__ctype_get_mb_cur_max
close_stdout_set_ignore_EPIPE
ignore_EPIPE
free_token
free
free_charset
quote
quote_n
get_quoting_style
default_quoting_options
set_quoting_flags
default_quoting_options
freopen_safer
fileno
dup2
dup2
dup2
freopen
protect_fd
protect_fd
protect_fd
__errno_location
close
close
close
__errno_location
free_tree
free_token
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
set_quoting_style
default_quoting_options
quoting_options_from_style
memset
quotearg_buffer_restyled
__ctype_get_mb_cur_max
L\"\\\"`'\"
L\"\\\"`'\"
gettext_quote
L\"\\\"`'\"
gettext_quote
L\"\\\"`'\"
strlen
abort
quotearg_buffer_restyled
memcmp
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
__ctype_b_loc
memset
strlen
mbrtowc
quotearg_buffer_restyled
iswprint
mbsinit
quotearg_buffer_restyled
quotearg_buffer_restyled
set_char_quoting
default_quoting_options
duplicate_tree
create_token_tree
set_custom_quoting
default_quoting_options
abort
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_229058
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
re_node_set_init_union
malloc
memcpy
memcpy
re_node_set_init_copy
re_node_set_init_copy
memset
gettext_quote
gettext
L\"\\\"`'\"
rpl_re_set_registers
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
quotearg_n
quotearg_n_options
default_quoting_options
re_node_set_insert_last
realloc
quotearg_alloc
quotearg_alloc_mem
quotearg
quotearg_n
re_node_set_compare
prune_impossible_nodes
malloc
malloc
memset
sift_ctx_init
sift_states_backward
free
merge_state_array
free
check_halt_state_context
sift_ctx_init
sift_states_backward
free
free
free
free
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_229058
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
bitset_empty
memset
quotearg_n_style
quoting_options_from_style
quotearg_n_options
check_matching
re_string_context_at
re_acquire_state_context
check_subexp_matching_top
extend_buffers
transit_state
merge_state_with_log
find_recover_state
check_halt_state_context
__assert_fail
\"err == REG_ESPACE\"
\"regexec.c\"
\"check_matching\"
check_halt_state_context
transit_state_bkref
__assert_fail
\"err == REG_ESPACE\"
\"regexec.c\"
\"check_matching\"
re_dfa_add_node
realloc
realloc
realloc
realloc
realloc
memset
memset
bitset_copy
memcpy
quotearg_n_mem
quotearg_n_options
default_quoting_options
quotearg_style
quotearg_n_style
check_halt_node_context
rpl_regcomp
malloc
strlen
re_compile_internal
free
rpl_re_compile_fastmap
bitset_mask
quotearg_mem
quotearg_n_mem
quotearg_char_mem
default_quoting_options
qword_229888
qword_229890
qword_229898
qword_2298A0
qword_2298A8
qword_2298B0
set_char_quoting
quotearg_n_options
check_halt_state_context
re_string_context_at
check_halt_node_context
re_string_elem_size_at
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_custom
quotearg_n_custom
quotearg_style_mem
quotearg_n_style_mem
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
bitset_set
init_dfa
memset
malloc
calloc
__ctype_get_mb_cur_max
nl_langinfo
strcasecmp
\"UTF-8\"
strcasecmp
\"UTF8\"
utf8_sb_map
calloc
btowc
quotearg_colon
quotearg_char
bitset_clear
re_string_allocate
re_string_construct_common
re_string_realloc_buffers
quotearg_colon_mem
quotearg_char_mem
quotearg_n_custom
quotearg_n_custom_mem
bitset_not
proceed_next_node
re_node_set_contains
push_fail_stack
re_node_set_contains
re_node_set_insert
check_node_accept_bytes
memcmp
re_node_set_insert
re_node_set_contains
re_node_set_contains
check_node_accept
quotearg_n_custom_mem
default_quoting_options
qword_229888
qword_229890
qword_229898
qword_2298A0
qword_2298A8
qword_2298B0
set_custom_quoting
quotearg_n_options
optimize_utf8
abort
re_string_char_size_at
bitset_contain
push_fail_stack
realloc
malloc
memcpy
re_node_set_init_copy
bitset_set_all
memset
build_wcs_upper_buffer
mbsinit
toupper
mbrtowc
memcpy
iswlower
towupper
wcrtomb
memcpy
mbrtowc
iswlower
towupper
wcrtomb
memcpy
memcpy
malloc
memcpy
re_string_realloc_buffers
realloc
realloc
realloc
lower_subexp
create_tree
create_tree
create_tree
create_tree
pop_fail_stack
__assert_fail
\"REG_VALID_INDEX (num)\"
\"regexec.c\"
\"pop_fail_stack\"
memcpy
free
free
bitset_merge
re_node_set_insert
re_node_set_init_1
realloc
duplicate_node
re_dfa_add_node
re_string_wchar_at
build_wcs_buffer
mbrtowc
set_regs
malloc
memset
malloc
free_fail_stack_return
memcpy
free
free
free_fail_stack_return
update_regs
free
free
free_fail_stack_return
pop_fail_stack
proceed_next_node
free
free
free_fail_stack_return
free
free
pop_fail_stack
free
free
re_node_set_contains
fetch_token
peek_token
re_string_construct
memset
re_string_construct_common
re_string_realloc_buffers
re_string_translate_buffer
build_wcs_buffer
build_upper_buffer
build_wcs_upper_buffer
re_string_realloc_buffers
re_string_peek_byte_case
free_fail_stack_return
free
free
free
re_acquire_state
calc_state_hash
re_node_set_compare
create_ci_newstate
re_string_skip_chars
mbrtowc
re_string_destruct
free
free
free
peek_token
re_string_peek_byte_case
__ctype_b_loc
re_string_wchar_at
iswalnum
__ctype_b_loc
re_string_wchar_at
iswalnum
peek_token
register_state
re_node_set_alloc
re_node_set_insert_last
realloc
update_regs
memcpy
memcpy
build_upper_buffer
toupper
__ctype_b_loc
re_string_context_at
bitset_contain
iswalnum
build_charclass_op
calloc
calloc
build_charclass
free
free_charset
bitset_set
bitset_not
bitset_mask
create_token_tree
free_charset
create_token_tree
create_tree
free
free_charset
re_compile_fastmap_iter
tolower
memset
mbrtowc
towlower
wcrtomb
tolower
memset
mbrtowc
memset
tolower
wcrtomb
towlower
wcrtomb
memset
sift_states_backward
re_node_set_init_1
update_cur_sifted_state
memset
free
update_cur_sifted_state
build_sifted_states
free
re_node_set_alloc
malloc
rpl_regexec
strlen
re_search_internal
re_search_internal
re_node_set_init_2
malloc
optimize_subexps
build_sifted_states
sift_states_iter_mb
check_node_accept
re_node_set_contains
check_dst_limits
re_node_set_insert
re_string_reconstruct
memset
bitset_contain
memset
mbrtowc
memset
re_string_skip_chars
re_string_context_at
iswalnum
memset
re_string_context_at
memmove
memmove
memset
re_string_context_at
memmove
memmove
build_upper_buffer
re_string_translate_buffer
build_wcs_upper_buffer
build_wcs_buffer
rpl_re_search_2
re_search_2_stub
clean_state_log_if_needed
extend_buffers
memset
re_node_set_add_intersect
realloc
memcpy
link_nfa_nodes
__assert_fail
\"node->next == NULL\"
\"regcomp.c\"
\"link_nfa_nodes\"
re_node_set_init_1
re_node_set_init_1
__assert_fail
\"REG_VALID_INDEX (left)\"
\"regcomp.c\"
\"link_nfa_nodes\"
__assert_fail
\"REG_VALID_INDEX (right)\"
\"regcomp.c\"
\"link_nfa_nodes\"
re_node_set_init_2
__assert_fail
\"!IS_EPSILON_NODE (node->token.type)\"
\"regcomp.c\"
\"link_nfa_nodes\"
extend_buffers
re_string_realloc_buffers
realloc
build_upper_buffer
build_wcs_upper_buffer
re_string_translate_buffer
build_wcs_buffer
re_copy_regs
realloc
realloc
free
__assert_fail
\"regs_allocated == REGS_FIXED\"
\"regexec.c\"
\"re_copy_regs\"
__assert_fail
\"regs->num_regs >= nregs\"
\"regexec.c\"
\"re_copy_regs\"
malloc
malloc
free
create_cd_newstate
calloc
free
malloc
free_state
re_node_set_init_copy
re_node_set_remove_at
free_state
register_state
re_node_set_init_copy
re_node_set_remove_at
match_ctx_clean
free
free
free
free
free
free
calc_eclosure_iter
re_node_set_alloc
duplicate_node_closure
calc_eclosure_iter
re_node_set_merge
free
re_node_set_insert
merge_state_array
re_node_set_init_union
re_acquire_state
free
calc_state_hash
match_ctx_add_subtop
realloc
calloc
re_compile_internal
realloc
init_dfa
free_dfa_content
re_string_construct
free_workarea_compile
re_string_destruct
free_dfa_content
optimize_utf8
create_initial_state
free_workarea_compile
re_string_destruct
free_dfa_content
parse
analyze
add_epsilon_src_nodes
re_acquire_state
re_node_set_alloc
re_node_set_merge
re_node_set_add_intersect
re_acquire_state_context
calc_state_hash
re_node_set_compare
create_cd_newstate
build_range_exp
strlen
strlen
btowc
btowc
wcscoll
realloc
realloc
bitset_set
wcscoll
wcscoll
xcharalloc
xmalloc
postorder
_sub_epsilon_src_nodes
memset
re_node_set_add_intersect
free
re_node_set_contains
re_node_set_contains
re_node_set_contains
re_node_set_contains
re_node_set_contains
re_node_set_remove_at
re_node_set_contains
free
free_state
free
free
free
free
free
free
free
free
xmalloc
malloc
xalloc_die
preorder
parse_bracket_element
re_string_char_size_at
parse_bracket_symbol
peek_token_bracket
re_string_wchar_at
x2realloc
x2nrealloc
lower_subexps
lower_subexp
lower_subexp
create_ci_newstate
calloc
free
free_state
register_state
re_node_set_init_copy
check_subexp_limits
sub_epsilon_src_nodes
sub_epsilon_src_nodes
re_node_set_contains
re_node_set_contains
sub_epsilon_src_nodes
build_equiv_class
strlen
bitset_set
xcalloc
calloc
xalloc_die
calc_first
re_dfa_add_node
rpl_regerror
abort
gettext
\"Success\"
_re_error_msgid_idx
strlen
memcpy
bkm_scale_by_power
bkm_scale
merge_state_with_log
re_node_set_init_union
re_string_context_at
re_acquire_state_context
free
check_subexp_matching_top
transit_state_bkref
free_dfa_content
free_token
free
free
free
free
free
free
free
free
free_state
free
free
free
utf8_sb_map
free
free
duplicate_node_closure
duplicate_node
re_node_set_insert
search_duplicated_node
duplicate_node
re_node_set_insert
duplicate_node_closure
re_node_set_insert
duplicate_node
re_node_set_insert
duplicate_node
re_node_set_insert
re_node_set_insert
locale_charset
nl_langinfo
unk_24D6E
get_charset_aliases
strlen
strlen
strcmp
strlen
STRING
build_charclass
\"alpha\"
strcmp
\"upper\"
strcmp
\"lower\"
realloc
wctype
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
strcmp
\"xdigit\"
bitset_set
__ctype_b_loc
bitset_set
__ctype_b_loc
strcmp
\"punct\"
strcmp
\"graph\"
strcmp
\"blank\"
strcmp
\"upper\"
strcmp
\"print\"
strcmp
\"digit\"
strcmp
\"alpha\"
strcmp
\"space\"
strcmp
\"lower\"
strcmp
\"cntrl\"
strcmp
\"alnum\"
get_subexp
search_cur_bkref_entry
clean_state_log_if_needed
memcmp
get_subexp_sub
extend_buffers
find_subexp_node
calloc
check_arrival
match_ctx_add_sublast
get_subexp_sub
create_initial_state
re_node_set_init_copy
re_node_set_merge
re_node_set_contains
re_acquire_state_context
re_acquire_state_context
re_acquire_state_context
re_acquire_state_context
free
is_basic_1
is_basic_table
parse_branch
parse_expression
parse_expression
create_tree
check_dst_limits_calc_pos_1
check_dst_limits_calc_pos_1
check_arrival_expand_ecl_sub
re_node_set_contains
re_node_set_contains
re_node_set_insert
re_node_set_insert
check_arrival_expand_ecl_sub
calc_next
parse_sub_exp
fetch_token
parse_reg_exp
create_tree
mbuiter_multi_next_0
is_basic_1
__assert_fail
\"mbsinit (&iter->state)\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strnlen1
mbrtowc
strlen
__assert_fail
\"*iter->cur.ptr == '\\\\0'\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
__assert_fail
\"iter->cur.wc == 0\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
sift_states_iter_mb
check_node_accept_bytes
re_node_set_contains
search_duplicated_node
group_nodes_into_DFAstates
bitset_empty
bitset_set
bitset_merge
bitset_set_all
bitset_merge
bitset_clear
memset
bitset_clear
bitset_clear
bitset_contain
bitset_empty
bitset_set
bitset_empty
bitset_copy
bitset_copy
re_node_set_init_copy
re_node_set_insert
bitset_contain
bitset_copy
bitset_empty
re_node_set_init_1
free
build_collating_symbol
strlen
bitset_set
calc_inveclosure
memset
re_node_set_insert_last
transit_state
transit_state_mb
build_trtable
re_string_context_at
search_cur_bkref_entry
mbsstr
strnlen
knuth_morris_pratt_unibyte
memset
mbuiter_multi_next_0
memset
memset
mbuiter_multi_next_0
mbuiter_multi_next_0
mbuiter_multi_next_0
knuth_morris_pratt_multibyte
memcmp
memset
mbuiter_multi_next_0
abort
mbuiter_multi_next_0
mbuiter_multi_next_0
memcmp
__ctype_get_mb_cur_max
parse_bracket_exp
calloc
calloc
peek_token_bracket
bitset_set
peek_token_bracket
parse_bracket_element
peek_token_bracket
peek_token_bracket
parse_bracket_element
peek_token_bracket
build_range_exp
bitset_set
realloc
build_equiv_class
build_collating_symbol
build_charclass
__assert_fail
\"0\"
\"regcomp.c\"
\"parse_bracket_exp\"
bitset_not
bitset_mask
create_token_tree
free
create_token_tree
create_tree
free_charset
create_token_tree
free
free_charset
calc_eclosure
calc_eclosure_iter
free
find_recover_state
merge_state_with_log
rpl_re_match
re_search_stub
record_relation
strcmp
xmalloc
match_ctx_add_sublast
realloc
calloc
parse
fetch_token
parse_reg_exp
create_tree
create_tree
check_subexp_matching_top
match_ctx_add_subtop
rpl_re_match_2
re_search_2_stub
walk_tree
recurse_tree
xmemdup
xmalloc
memcpy
parse_reg_exp
parse_branch
fetch_token
parse_branch
create_tree
main
set_program_name
setlocale
shortopts
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
\"coreutils\"
STRING
usage
STRING
usage
getopt_long
shortopts
quote
optind
gettext
\"extra operand %s\"
error
usage
optind
\"-\"
optind
optind
tsort
exit
re_search_stub
rpl_re_compile_fastmap
malloc
re_copy_regs
re_search_internal
__assert_fail
\"pmatch[0].rm_so == start\"
\"regexec.c\"
\"re_search_stub\"
free
xstrtoul
__assert_fail
\"0 <= strtol_base && strtol_base <= 36\"
\"xstrtol.c\"
\"xstrtoul\"
__ctype_b_loc
__errno_location
strtoul
strchr
__errno_location
__errno_location
strchr
strchr
bkm_scale
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale
bkm_scale
base_len
strlen
transit_state_bkref
get_subexp
re_string_context_at
re_node_set_init_union
free
re_acquire_state_context
free
re_acquire_state_context
check_subexp_matching_top
transit_state_bkref
re_string_context_at
update_cur_sifted_state
add_epsilon_src_nodes
check_subexp_limits
re_acquire_state
sift_states_bkref
parse_expression
create_token_tree
fetch_token
create_token_tree
create_tree
create_token_tree
create_token_tree
parse_sub_exp
init_word_char
create_token_tree
create_token_tree
create_token_tree
create_tree
create_token_tree
fetch_token
parse_bracket_exp
fetch_token
parse_expression
create_token_tree
fetch_token
build_charclass_op
\"alnum\"
unk_24A24
build_charclass_op
\"space\"
unk_24A2C
parse_dup_op
str_iconv
iconv_open
str_cd_iconv
__errno_location
free
__errno_location
iconv_close
__errno_location
iconv_close
__errno_location
strdup
__errno_location
c_strcasecmp
freopen_safer
fileno
dup2
dup2
dup2
freopen
protect_fd
protect_fd
protect_fd
__errno_location
close
close
close
__errno_location
check_arrival_expand_ecl
re_node_set_alloc
re_node_set_merge
check_arrival_expand_ecl_sub
free
find_subexp_node
free
check_dst_limits
search_cur_bkref_entry
search_cur_bkref_entry
check_dst_limits_calc_pos
check_dst_limits_calc_pos
free_charset
free
free
free
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
gettext_quote
gettext
L\"\\\"`'\"
c_isascii
create_tree
create_token_tree
check_dst_limits_calc_pos
check_dst_limits_calc_pos_1
c_isalnum
c_isblank
c_iscntrl
c_islower
create_token_tree
malloc
c_isprint
sift_states_bkref
search_cur_bkref_entry
re_node_set_init_copy
re_node_set_insert
sift_states_backward
merge_state_array
re_node_set_contains
re_node_set_remove_at
re_node_set_contains
check_dst_limits
free
build_trtable
malloc
group_nodes_into_DFAstates
free
calloc
re_node_set_alloc
malloc
bitset_empty
re_node_set_merge
re_acquire_state_context
re_acquire_state_context
re_acquire_state_context
bitset_merge
calloc
free
free
free
free
calloc
bitset_contain
bitset_contain
free
free
free
free
quotearg_buffer_restyled
__ctype_get_mb_cur_max
L\"\\\"`'\"
L\"\\\"`'\"
gettext_quote
L\"\\\"`'\"
gettext_quote
L\"\\\"`'\"
strlen
abort
quotearg_buffer_restyled
memcmp
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
quotearg_buffer_restyled
__ctype_b_loc
memset
strlen
mbrtowc
quotearg_buffer_restyled
iswprint
mbsinit
quotearg_buffer_restyled
quotearg_buffer_restyled
rpl_re_search
re_search_stub
c_isspace
transit_state_mb
check_node_accept_bytes
clean_state_log_if_needed
re_node_set_init_union
re_string_context_at
re_acquire_state_context
free
re_string_context_at
sift_ctx_init
memset
set_char_quoting
default_quoting_options
c_isxdigit
re_search_2_stub
malloc
memcpy
memcpy
re_search_stub
re_search_stub
re_search_stub
free
find_subexp_node
x2nrealloc
xalloc_die
xrealloc
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
mmalloca
malloc
mmalloca_results
mmalloca_results
xstrdup
strlen
xmemdup
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_208028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
check_arrival_add_next_nodes
memset
check_node_accept_bytes
re_node_set_merge
re_node_set_insert
re_acquire_state
free
free
check_node_accept
re_node_set_insert
free
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_n
quotearg_n_options
default_quoting_options
.free
free
c_strcasecmp
c_tolower
c_tolower
quotearg_n_mem
quotearg_n_options
default_quoting_options
.strncmp
strncmp
quotearg_mem
quotearg_n_mem
.puts
puts
.fclose
fclose
.strlen
strlen
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
.gettext
gettext
quotearg_style_mem
quotearg_n_style_mem
.dup2
dup2
quotearg_char
quotearg_char_mem
.__assert_fail
_assert_fail
knuth_morris_pratt_unibyte
strlen
mmalloca
freea
quotearg_colon
quotearg_char
expand_bkref_cache
search_cur_bkref_entry
re_node_set_contains
re_node_set_init_1
check_arrival_expand_ecl
re_node_set_merge
free
re_node_set_contains
re_node_set_init_1
re_node_set_contains
re_node_set_init_copy
re_node_set_insert
re_acquire_state
free
free
.close
close
quotearg_colon_mem
quotearg_char_mem
re_search_internal
re_string_allocate
match_ctx_init
malloc
re_string_reconstruct
re_string_reconstruct
check_matching
check_halt_state_context
set_regs
prune_impossible_nodes
match_ctx_clean
free
match_ctx_free
re_string_destruct
mem_cd_iconv
iconv
iconv
__errno_location
__errno_location
iconv
malloc
__errno_location
iconv
iconv
__errno_location
iconv
abort
__errno_location
free
__errno_location
.ferror_unlocked
ferror_unlocked
quotearg_n_custom
quotearg_n_custom_mem
get_subexp_sub
check_arrival
match_ctx_add_entry
clean_state_log_if_needed
check_node_accept_bytes
re_string_char_size_at
re_string_elem_size_at
re_string_wchar_at
iswctype
wcscoll
wcscoll
.fprintf
fprintf
c_isalpha
quotearg_n_custom_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_custom_quoting
quotearg_n_options
xnmalloc
xalloc_die
xmalloc
.setlocale
setlocale
c_isdigit
.__cxa_atexit
_cxa_atexit
xnrealloc
xalloc_die
xrealloc
c_isgraph
.mbsinit
mbsinit
.__ctype_b_loc
_ctype_b_loc
xrealloc
realloc
xalloc_die
xnmalloc
xalloc_die
xmalloc
deregister_tm_clones
_bss_start
c_ispunct
check_arrival
realloc
memset
re_string_context_at
re_node_set_init_1
check_arrival_expand_ecl
re_node_set_init_copy
memset
expand_bkref_cache
free
re_acquire_state_context
free
re_node_set_merge
check_arrival_add_next_nodes
check_arrival_expand_ecl
expand_bkref_cache
re_string_context_at
re_acquire_state_context
free
re_node_set_contains
xzalloc
xmalloc
memset
frame_dummy
register_tm_clones
xcharalloc
xmalloc
c_isupper
bkm_scale
xmalloc
malloc
xalloc_die
c_tolower
x2realloc
x2nrealloc
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION] [FILE]\\nWrite totally ordered list consistent with the partial ordering in FILE.\\nWith no FILE, or when FILE is -, read standard input.\\n\\n\"
printf
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
xzalloc
xmalloc
memset
count_items
n_strings
freea
mmalloca_results
free
check_node_accept
bitset_contain
re_string_context_at
get_charset_aliases
charset_aliases
getenv
\"CHARSETALIASDIR\"
STRING
strlen
strlen
STRING
malloc
memcpy
memcpy
STRING
open
fdopen
\"r\"
getc_unlocked
getc_unlocked
ungetc
fscanf
\"%50s %50s\"
strlen
strlen
realloc
malloc
free
strcpy
strcpy
fclose
unk_24D6E
close
unk_24D6E
unk_24D6E
free
unk_24D6E
charset_aliases
charset_aliases
xstrdup
strlen
xmemdup
__libc_csu_fini
match_ctx_init
malloc
malloc
detect_loop
loop
loop
loop
fprintf
stderr
\"%s: %s\\n\"
program_name
loop
loop
loop
loop
loop
loop
loop
loop
loop
loop
loop
loop
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
off_6C39
abort
atexit
__cxa_atexit
_dso_handle
match_ctx_free
match_ctx_clean
free
free
str_cd_iconv
strlen
malloc
iconv
iconv
__errno_location
__errno_location
__errno_location
__errno_location
free
__errno_location
realloc
iconv
__errno_location
realloc
realloc
__errno_location
fstat
__fxstat
last_component
.term_proc
match_ctx_add_entry
realloc
free
memset
c_toupper
close_stdout_set_file_name
file_name
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
xstrtoumax
__assert_fail
\"0 <= strtol_base && strtol_base <= 36\"
\"xstrtol.c\"
\"xstrtoumax\"
__ctype_b_loc
__errno_location
strtoumax
strchr
__errno_location
__errno_location
strchr
strchr
bkm_scale
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale_by_power
bkm_scale
bkm_scale
.__errno_location
_errno_location
protect_fd
open
\"/dev/null\"
close
__errno_location
mb_copy
memcpy
mbuiter_multi_next_1
is_basic_2
__assert_fail
\"mbsinit (&iter->state)\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strnlen1
mbrtowc
strlen
__assert_fail
\"*iter->cur.ptr == '\\\\0'\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
__assert_fail
\"iter->cur.wc == 0\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
.__fpending
_fpending
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quote_n
quotearg_n_style
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
.textdomain
textdomain
knuth_morris_pratt_multibyte
mbslen
mmalloca
memset
mbuiter_multi_next_0
mb_copy
memcmp
memset
memset
mbuiter_multi_next_0
memcmp
mbuiter_multi_next_0
abort
mbuiter_multi_next_0
abort
freea
quote
quote_n
.__ctype_get_mb_cur_max
_ctype_get_mb_cur_max
is_basic_2
is_basic_table
.__stack_chk_fail
_stack_chk_fail
search_item
__assert_fail
\"root\"
\"tsort.c\"
\"search_item\"
strcmp
new_item
__assert_fail
\"!STREQ (str, s->str)\"
\"tsort.c\"
\"search_item\"
strcmp
strcmp
__assert_fail
\"!STREQ (str, p->str)\"
\"tsort.c\"
\"search_item\"
strcmp
strcmp
new_item
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
.mbrtowc
mbrtowc
mbslen
strlen
__ctype_get_mb_cur_max
memset
mbuiter_multi_next_1
show_dev
quote
__errno_location
error
\"%s\"
exit_status
get_fs_usage
file_systems_processed
print_header
file_systems_processed
STRING
STRING
strlen
printf
\"%s\\n%18s  \"
printf
\"%s %s\"
posix_format
printf
\"%s%*s  \"
strlen
printf
\"%s\\n%20s\"
locale
printf
\"%-20s\"
strlen
posix_format
print_type
qword_211108
known_value
qword_211110
known_value
human_output_opts
output_block_size
posix_format
human_output_opts
posix_format
human_output_opts
output_block_size
known_value
qword_2110E8
known_value
qword_2110F0
known_value
add_uint_with_neg_flag
qword_2110F8
byte_211100
known_value
inode_format
known_value
known_value
df_readable
df_readable
df_readable
printf
\" %*s %*s %*s \"
known_value
known_value
printf
\"%*s\"
STRING
printf
\"%*.0f%%\"
printf
\" %s\"
putchar_unlocked
show_all_fs
show_listed_fs
show_local_fs
show_all_fs
show_listed_fs
selected_fstype
excluded_fstype
quotearg_n_mem
quotearg_n_options
default_quoting_options
.strrchr
strrchr
sub_1260
set_quoting_style
default_quoting_options
.memset
memset
.abort
abort
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
.memcmp
memcmp
._exit
exit
quotearg_colon
quotearg_char
.calloc
calloc
.getc_unlocked
getc_unlocked
set_quoting_flags
default_quoting_options
quotearg_n_custom
quotearg_n_custom_mem
.bindtextdomain
bindtextdomain
.memcpy
memcpy
quotearg_custom
quotearg_n_custom
set_custom_quoting
default_quoting_options
abort
trim2
strdup
xalloc_die
__ctype_b_loc
strlen
memmove
strlen
__ctype_b_loc
strlen
memset
mbiter_multi_next
iswspace
strlen
memmove
strlen
memset
mbiter_multi_next
iswspace
iswspace
iswspace
iswspace
iswspace
__ctype_get_mb_cur_max
.getopt_long
getopt_long
.malloc
malloc
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
.printf
printf
.error
error
quotearg_mem
quotearg_n_mem
.freopen
freopen
init_tokenbuffer
.exit
exit
quotearg_style
quotearg_n_style
.fputs_unlocked
fputs_unlocked
.iswprint
iswprint
.strcmp
strcmp
quotearg_style_mem
quotearg_n_style_mem
readtokens
xnmalloc
xnmalloc
init_tokenbuffer
readtoken
x2nrealloc
xnrealloc
xnmalloc
memcpy
free
.fileno
fileno
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
quotearg_char
quotearg_char_mem
xmemdup
xmalloc
memcpy
.realloc
realloc
human_readable
unk_E5A9
unk_E5AB
localeconv
strlen
strlen
memcpy
memcpy
adjust_value
sprintf
\"%.1Lf\"
strlen
adjust_value
sprintf
\"%.0Lf\"
strlen
adjust_value
sprintf
\"%.0Lf\"
strlen
memmove
group_number
power_letter
new_item
xmalloc
xstrdup
quotearg_colon_mem
quotearg_char_mem
.open
open
version_etc_ar
version_etc_arn
knuth_morris_pratt_multibyte
mbslen
mmalloca
memset
mbuiter_multi_next_0
mb_copy
memcmp
memset
memset
mbuiter_multi_next_0
memcmp
mbuiter_multi_next_0
abort
mbuiter_multi_next_0
abort
freea
.fwrite
fwrite
scan_zeros
zeros
head
head
zeros
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
quotearg_n_custom_mem
default_quoting_options
qword_207108
qword_207110
qword_207118
qword_207120
qword_207128
qword_207130
set_custom_quoting
quotearg_n_options
cdb_fchdir
fchdir
__cxa_finalize
__cxa_finalize
register_tm_clones
find_non_slash
strspn
\"/\"
xnmalloc
xalloc_die
xmalloc
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
xnrealloc
xalloc_die
xrealloc
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
tsort
strcmp
\"-\"
new_item
__errno_location
error
\"%s\"
freopen_safer
STRING
stdin
init_tokenbuffer
readtoken
stdin
STRING
__assert_fail
\"len != 0\"
\"tsort.c\"
\"tsort\"
search_item
record_relation
gettext
